## Dealing Nan values

In [1]:
# importing packages
import pandas as pd
import numpy as np

In [2]:
# creating dataframe from dictionary
df = pd.DataFrame({'A':[1,2,3,4],
                  'B':[2,4,np.nan,5],
                  'v':[3,np.nan,np.nan,6]})

In [3]:
df

   A    B    v
0  1  2.0  3.0
1  2  4.0  NaN
2  3  NaN  NaN
3  4  5.0  6.0

## Drop nan in row

In [7]:
df.dropna(axis=0)

   A    B    v
0  1  2.0  3.0
3  4  5.0  6.0

## Drop nan in column

In [6]:
df.dropna(axis=1)

   A
0  1
1  2
2  3
3  4

In [11]:
# drop morethan 2 nan
df.dropna(thresh=2)

   A    B    v
0  1  2.0  3.0
1  2  4.0  NaN
3  4  5.0  6.0

## Fill Nan data

In [12]:
# fill nan values with user defined values
df.fillna(value = 'fill')

   A     B     v
0  1   2.0   3.0
1  2   4.0  fill
2  3  fill  fill
3  4   5.0   6.0

In [13]:
# fill user defined values with nan 
df['v'].fillna(value=0)

0    3.0
1    0.0
2    0.0
3    6.0
Name: v, dtype: float64

In [14]:
# Replacing with mean data
df['B'].fillna(df['B'].mean())

0    2.000000
1    4.000000
2    3.666667
3    5.000000
Name: B, dtype: float64